wosayttn/M55M1BSP/Library/StdDriver/src/qspi.c
/**************************************************************************//**
 * @file     qspi.c
 * @version  V1.00
 * @brief    QSPI driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup QSPI_Driver QSPI Driver
  @{
*/

/** @addtogroup QSPI_EXPORTED_FUNCTIONS QSPI Exported Functions
  @{
*/

/*Select PCLK as the clock source of QSPI */
static uint32_t SelectPCLKxSourceOfQSPI(QSPI_T *qspi)
{
    uint32_t u32RetValue = 0;

    if (qspi == QSPI0)
    {
        CLK->QSPISEL = (CLK->QSPISEL & (~CLK_QSPISEL_QSPI0SEL_Msk)) | CLK_QSPISEL_QSPI0SEL_PCLK0;
        u32RetValue = CLK_GetPCLK0Freq();
    }
    else if (qspi == QSPI1)
    {
        CLK->QSPISEL = (CLK->QSPISEL & (~CLK_QSPISEL_QSPI1SEL_Msk)) | CLK_QSPISEL_QSPI1SEL_PCLK2;
        u32RetValue = CLK_GetPCLK1Freq();
    }

    return u32RetValue;
}

static uint32_t CheckQSPI1ClockSource(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->QSPISEL & CLK_QSPISEL_QSPI1SEL_Msk)
    {
        case CLK_QSPISEL_QSPI1SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_QSPISEL_QSPI1SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() / 2); /* Clock source is PLL */
            break;

        case CLK_QSPISEL_QSPI1SEL_PCLK2:
            u32ClkSrc = (CLK_GetPCLK2Freq() / 2); /* Clock source is PCLK0 */
            break;

        case CLK_QSPISEL_QSPI1SEL_HIRC:
            u32ClkSrc = __HIRC;
            break;

        case CLK_QSPISEL_QSPI1SEL_HIRC48M_DIV4:
            u32ClkSrc = (__HIRC48M / 4);
            break;
    }

    return u32ClkSrc;
}

static uint32_t CheckQSPI0ClockSource(void)
{
    uint32_t u32ClkSrc = 0;

    switch (CLK->QSPISEL & CLK_QSPISEL_QSPI0SEL_Msk)
    {
        case CLK_QSPISEL_QSPI0SEL_HXT:
            u32ClkSrc = __HXT; /* Clock source is HXT */
            break;

        case CLK_QSPISEL_QSPI0SEL_APLL0_DIV2:
            u32ClkSrc = (CLK_GetAPLL0ClockFreq() / 2); /* Clock source is PLL */
            break;

        case CLK_QSPISEL_QSPI0SEL_PCLK0:
            u32ClkSrc = CLK_GetPCLK0Freq(); /* Clock source is PCLK0 */
            break;

        case CLK_QSPISEL_QSPI0SEL_HIRC:
            u32ClkSrc = __HIRC;
            break;

        case CLK_QSPISEL_QSPI0SEL_HIRC48M_DIV4:
            u32ClkSrc = (__HIRC48M / 4);
            break;
    }

    return u32ClkSrc;
}

/**
  * @brief  This function make QSPI module be ready to transfer.
  * @param[in]  qspi The pointer of the specified QSPI module.
  * @param[in]  u32MasterSlave Decides the QSPI module is operating in master mode or in slave mode. (QSPI_SLAVE, QSPI_MASTER)
  * @param[in]  u32QSPIMode Decides the transfer timing. (QSPI_MODE_0, QSPI_MODE_1, QSPI_MODE_2, QSPI_MODE_3)
  * @param[in]  u32DataWidth Decides the data width of a QSPI transaction.
  * @param[in]  u32BusClock The expected frequency of QSPI bus clock in Hz.
  * @return Actual frequency of QSPI peripheral clock.
  * @details By default, the QSPI transfer sequence is MSB first, the slave selection signal is active low and the automatic
  *          slave selection function is disabled.
  *          In Slave mode, the u32BusClock shall be NULL and the QSPI clock divider setting will be 0.
  *          The actual clock rate may be different from the target QSPI clock rate.
  *          For example, if the QSPI source clock rate is 12 MHz and the target QSPI bus clock rate is 7 MHz, the
  *          actual QSPI clock rate will be 6MHz.
  * @note   If u32BusClock = 0, DIVIDER setting will be set to the maximum value.
  * @note   If u32BusClock >= system clock frequency, QSPI peripheral clock source will be set to APB clock and DIVIDER will be set to 0.
  * @note   If u32BusClock >= QSPI peripheral clock source, DIVIDER will be set to 0.
  * @note   In slave mode, the QSPI peripheral clock rate will be equal to APB clock rate.
  */
uint32_t QSPI_Open(QSPI_T *qspi,
                   uint32_t u32MasterSlave,
                   uint32_t u32QSPIMode,
                   uint32_t u32DataWidth,
                   uint32_t u32BusClock)
{
    uint32_t u32ClkSrc = 0U, u32Div, u32HCLKFreq, u32RetValue = 0U;

    if (u32DataWidth == 32U)
    {
        u32DataWidth = 0U;
    }

    /* Get system clock frequency */
    u32HCLKFreq = CLK_GetSCLKFreq();//CLK_GetHCLK0Freq();

    if (u32MasterSlave == QSPI_MASTER)
    {
        /* Default setting: slave selection signal is active low; disable automatic slave selection function. */
        qspi->SSCTL = QSPI_SS_ACTIVE_LOW;

        /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 0. */
        qspi->CTL = u32MasterSlave | (u32DataWidth << QSPI_CTL_DWIDTH_Pos) | (u32QSPIMode) | QSPI_CTL_QSPIEN_Msk;

        if (u32BusClock >= u32HCLKFreq)
        {
            /* Select PCLK as the clock source of QSPI */
            //if (qspi == QSPI0)
            //    CLK->QSPISEL = (CLK->QSPISEL & (~CLK_QSPISEL_QSPI0SEL_Msk)) | CLK_QSPISEL_QSPI0SEL_PCLK0;
            //else if (qspi == QSPI1)
            //    CLK->QSPISEL = (CLK->QSPISEL & (~CLK_QSPISEL_QSPI1SEL_Msk)) | CLK_QSPISEL_QSPI1SEL_PCLK1;
            SelectPCLKxSourceOfQSPI(qspi);
        }

        /* Check clock source of QSPI */
        if (qspi == QSPI0)
        {
            u32ClkSrc = CheckQSPI0ClockSource();
        }
        else if (qspi == QSPI1)
        {
            u32ClkSrc = CheckQSPI1ClockSource();
        }

        if (u32BusClock >= u32HCLKFreq)
        {
            /* Set DIVIDER = 0 */
            qspi->CLKDIV = 0U;
            /* Return master peripheral clock rate */
            u32RetValue = u32ClkSrc;
        }
        else if (u32BusClock >= u32ClkSrc)
        {
            /* Set DIVIDER = 0 */
            qspi->CLKDIV = 0U;
            /* Return master peripheral clock rate */
            u32RetValue = u32ClkSrc;
        }
        else if (u32BusClock == 0U)
        {
            /* Set DIVIDER to the maximum value 0xFF. f_qspi = f_qspi_clk_src / (DIVIDER + 1) */
            qspi->CLKDIV |= QSPI_CLKDIV_DIVIDER_Msk;
            /* Return master peripheral clock rate */
            u32RetValue = (u32ClkSrc / (0xFFU + 1U));
        }
        else
        {
            u32Div = (((u32ClkSrc * 10U) / u32BusClock + 5U) / 10U) - 1U; /* Round to the nearest integer */

            if (u32Div > 0xFFU)
            {
                u32Div = 0xFFU;
                qspi->CLKDIV |= QSPI_CLKDIV_DIVIDER_Msk;
                /* Return master peripheral clock rate */
                u32RetValue = (u32ClkSrc / (0xFFU + 1U));
            }
            else
            {
                qspi->CLKDIV = (qspi->CLKDIV & (~QSPI_CLKDIV_DIVIDER_Msk)) | (u32Div << QSPI_CLKDIV_DIVIDER_Pos);
                /* Return master peripheral clock rate */
                u32RetValue = (u32ClkSrc / (u32Div + 1U));
            }
        }
    }
    else     /* For slave mode, force the QSPI peripheral clock rate to equal APB clock rate. */
    {
        /* Default setting: slave selection signal is low level active. */
        qspi->SSCTL = QSPI_SS_ACTIVE_LOW;

